In [1]:
import numpy as np
import pandas as pd

In [2]:
tab1 = {
    "Name":["Tushar", "Suman", "Rishi"],
    "Subject":["DSA","DBMS","MCO"],
    "Marks":[97,85,90]
}

In [3]:
df = pd.DataFrame(tab1)

In [4]:
df

     Name Subject  Marks
0  Tushar     DSA     97
1   Suman    DBMS     85
2   Rishi     MCO     90

In [5]:
df.to_csv('Marks.csv')

In [6]:
df.describe()

           Marks
count   3.000000
mean   90.666667
std     6.027714
min    85.000000
25%    87.500000
50%    90.000000
75%    93.500000
max    97.000000

In [7]:
newdf = pd.DataFrame(np.random.rand(300,5), index = np.arange(300))

In [8]:
newdf.head()

          0         1         2         3         4
0  0.029053  0.356290  0.882219  0.239248  0.757680
1  0.260783  0.543805  0.753485  0.276999  0.346748
2  0.080283  0.683912  0.474755  0.117210  0.989637
3  0.574999  0.256293  0.333412  0.817463  0.126547
4  0.038706  0.806470  0.794408  0.257220  0.410440

In [9]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [10]:
df.dtypes

Name       object
Subject    object
Marks       int64
dtype: object

In [11]:
ser = pd.Series(np.random.rand(10))

In [12]:
ser

0    0.457376
1    0.096061
2    0.221057
3    0.479163
4    0.766175
5    0.530248
6    0.501765
7    0.405388
8    0.466186
9    0.320208
dtype: float64

In [13]:
df.loc[[0,1]]

     Name Subject  Marks
0  Tushar     DSA     97
1   Suman    DBMS     85

In [14]:
df = pd.read_csv('Marks.csv')

In [15]:
df

   Unnamed: 0    Name Subject  Marks
0           0  Tushar     DSA     97
1           1   Suman    DBMS     85
2           2   Rishi     MCO     90

In [16]:
employee = {
    "ID":[101 ,102 ,103 ,104 ,105 ],
    "Name":["Tushar","Suman","Rishi","Dev","Ayush"],
    "Designation":["Buisness Analyst","Technical Architect","Manager","HR Analyst","Salesman"],
    "Salary":[50000,60000,70000,45000,35000]
}

In [17]:
df = pd.DataFrame(employee)

In [18]:
df

    ID    Name          Designation  Salary
0  101  Tushar     Buisness Analyst   50000
1  102   Suman  Technical Architect   60000
2  103   Rishi              Manager   70000
3  104     Dev           HR Analyst   45000
4  105   Ayush             Salesman   35000

In [19]:
df.to_csv('Employee.csv')

In [20]:
employee['Name'][2]

'Rishi'

In [21]:
employee['Salary'][2] = 65000

In [22]:
df = pd.DataFrame(employee)

In [23]:
df

    ID    Name          Designation  Salary
0  101  Tushar     Buisness Analyst   50000
1  102   Suman  Technical Architect   60000
2  103   Rishi              Manager   65000
3  104     Dev           HR Analyst   45000
4  105   Ayush             Salesman   35000

In [24]:
df.set_index("ID")

       Name          Designation  Salary
ID
101  Tushar     Buisness Analyst   50000
102   Suman  Technical Architect   60000
103   Rishi              Manager   65000
104     Dev           HR Analyst   45000
105   Ayush             Salesman   35000

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
emp = df

In [27]:
emp

    ID    Name          Designation  Salary
0  101  Tushar     Buisness Analyst   50000
1  102   Suman  Technical Architect   60000
2  103   Rishi              Manager   65000
3  104     Dev           HR Analyst   45000
4  105   Ayush             Salesman   35000

In [28]:
emp.rename(columns = {'Name' : 'emp_name'}, inplace = True)

In [29]:
emp

    ID emp_name          Designation  Salary
0  101   Tushar     Buisness Analyst   50000
1  102    Suman  Technical Architect   60000
2  103    Rishi              Manager   65000
3  104      Dev           HR Analyst   45000
4  105    Ayush             Salesman   35000

In [30]:
city = ['Delhi', 'Bangalore', 'Chennai', 'Patna', 'Mumbai']

In [31]:
emp['City'] = city

In [32]:
emp

    ID emp_name          Designation  Salary       City
0  101   Tushar     Buisness Analyst   50000      Delhi
1  102    Suman  Technical Architect   60000  Bangalore
2  103    Rishi              Manager   65000    Chennai
3  104      Dev           HR Analyst   45000      Patna
4  105    Ayush             Salesman   35000     Mumbai

In [33]:
emp['ID']

0    101
1    102
2    103
3    104
4    105
Name: ID, dtype: int64

In [34]:
df = pd.read_csv('Employee.csv')